In [28]:
!pip install pandas pymongo

Requirement already satisfied: pandas in c:\users\gpier\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: pymongo in c:\users\gpier\anaconda3\lib\site-packages (4.9.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\gpier\anaconda3\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gpier\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\gpier\anaconda3\lib\site-packages (from pandas) (2.0.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\gpier\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: dnspython<3.0.0,>=1.16.0 in c:\users\gpier\anaconda3\lib\site-packages (from pymongo) (2.6.1)
Requirement already satisfied: six>=1.5 in c:\users\gpier\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [153]:
import sqlite3
import pandas
import pymongo

URL = "mongodb+srv://mongo_user:9EDPMOQuJhzYGjK7@cluster-but-sd.hpg62.mongodb.net/?retryWrites=true&w=majority&appName=cluster-but-sd"
client = pymongo.MongoClient(URL)
db = client.sae

# Création de la connexion 
conn = sqlite3.connect("ClassicModel.sqlite")

In [34]:
# Requêtes SQL pour récuperer les données de chaque table
products = pandas.read_sql_query(
    """
    SELECT *
    from Products;
    """,
    conn
)

customers = pandas.read_sql_query(
    """
    SELECT *
    from Customers;
    """,
    conn
)

offices = pandas.read_sql_query(
    """
    SELECT *
    from Offices;
    """,
    conn
)

# ========================================================================================

payments = pandas.read_sql_query(
    """
    SELECT *
    from Payments;
    """,
    conn
)

orders = pandas.read_sql_query(
    """
    SELECT *
    from Orders;
    """,
    conn
)

employees = pandas.read_sql_query(
    """
    SELECT *
    from Employees;
    """,
    conn
)

# ========================================================================================

orderdetails = pandas.read_sql_query(
    """
    SELECT *
    from OrderDetails;
    """,
    conn
)

# Visualiser les résultats des requêtes SQL
products.to_dict(orient = "records") #Extraction en documents de products
customers.to_dict(orient = "records") #Extraction en documents de customers
offices.to_dict(orient = "records") #Extraction en documents de offices

# Imbriquer nos extractions de table pour créer la collection Customers
orders = orders.assign(
OrderDetails = [list(orderdetails.query("orderNumber == @id").drop(columns=["orderNumber"]).to_dict(orient="records")) if id in list(orderdetails.orderNumber) else None for id in orders.orderNumber])

customers = customers.assign(
             Payments = [list(payments.query("customerNumber == @id").drop(columns=["customerNumber"]).to_dict(orient="records")) if id in list(payments.customerNumber) else None for id in customers.customerNumber],
             Orders = [list(orders.query("customerNumber == @id").drop(columns=["customerNumber"]).to_dict(orient="records")) if id in list(orders.customerNumber) else None for id in customers.customerNumber])

# Visualisation du résultat pour s'assurer que tout a bien été récupéré
customers.to_dict(orient = "records") #Extraction en documents de customers

# Visualisation des données de la collection Products
products.to_dict(orient = "records") #Extraction en documents de products

# Imbriquer nos extractions de table pour créer la collection Offices
offices = offices.assign(
Employees = [list(employees.query("officeCode == @id").drop(columns=["officeCode"]).to_dict(orient="records")) if id in list(employees.officeCode) else None for id in offices.officeCode])

# Visualisation de la collection Offices
offices.to_dict(orient = "records") #Extraction en documents de offices

# Import des données dans dans le serveur MongoDB
db.Customers.insert_many(
    customers.to_dict(orient = "records") #Extraction en documents de customers
)

db.Offices.insert_many(
    offices.to_dict(orient = "records") #Extraction en documents de customers
)

db.Products.insert_many(
    products.to_dict(orient = "records") #Extraction en documents de customers
)

In [42]:
# Vérification du nombre de clients
db.Customers.count_documents({})

122

In [43]:
# Vérification du nombre de bureaux
db.Offices.count_documents({})

7

In [44]:
# Vérification du nombre de produits
db.Products.count_documents({})

110

In [46]:
rq1 = db.Customers.find(
    { "Orders": None },  # None pour trouver les champs null
    { "_id": 0, "customerName": 1,"customerNumber": 1 }
)

df = pandas.DataFrame(list(rq1))
print(df)

# On liste les clients, on trouve le nom des entreprises tel que Porto Imports Co., ANG Ressellers, etc

    customerNumber                    customerName
0              169               Porto Imports Co.
1              223                 Natürlich Autos
2              237                   ANG Resellers
3              293               BG&E Collectables
4              303                Schuyler Imports
5              307                Der Hund Imports
6              206      Asian Shopping Network, Co
7              247        Messner Shopping Network
8              125              Havel & Zbyszek Co
9              168          American Souvenirs Inc
10             273               Franken Gifts, Co
11             356            SAR Distributors, Co
12             409  Stuttgart Collectable Exchange
13             477             Mit Vergnügen & Co.
14             481              Raanan Stores, Inc
15             348           Asian Treasures, Inc.
16             480       Kremlin Collectables, Co.
17             369          Lisboa Souveniers, Inc
18             376           Precious Collectables
19             459                Warburg Exchange
20             465             Anton Designs, Ltd.
21             335       Cramer Spezialitäten, Ltd
22             361                 Kommission Auto
23             443        Feuer Online Stores, Inc

In [95]:
rq2 = db.Offices.aggregate([
    { "$unwind": "$Employees" },

    { 
        "$lookup": {
            "from": "Customers",
            "localField": "Employees.employeeNumber",
            "foreignField": "salesRepEmployeeNumber",
            "as": "Clients"
        }
    },

    { 
        "$addFields": { 
            "nombreClients": { "$size": "$Clients" },
            "totalCommandes": { 
                "$sum": { 
                    "$map": { 
                        "input": "$Clients", 
                        "as": "client", 
                        "in": { 
                            "$size": { "$ifNull": [ "$$client.Orders", [] ] }
                        } 
                    } 
                }
            },
        }
    },

    { "$unwind": {
        "path": "$Clients",
        "preserveNullAndEmptyArrays": True
    }},
    
    { "$unwind": {
        "path": "$Clients.Orders",
        "preserveNullAndEmptyArrays": True
    }},
    
    { "$unwind": {
        "path": "$Clients.Payments",
        "preserveNullAndEmptyArrays": True
    }},
    
    { 
        "$group": { 
            "_id": "$Employees.employeeNumber",
            "prenom": { "$first": "$Employees.firstName" },  
            "nom": { "$first": "$Employees.lastName" },     
            "nombreClients": { "$first": "$nombreClients" }, 
            "totalCommandes": { "$first": "$totalCommandes" }, 
            "totalPayments": { "$sum": "$Clients.Payments.amount" }  
        }
    },
    {
        "$project": {
            "_id": 0,
            "employeeNumber": "$_id",
            "firstname": "$prenom",
            "lastname": "$nom",
            "numberOfCustomers": "$nombreClients",
            "numberOfOrders": "$totalCommandes",
            "totalOrderAmount": {
                "$cond": {
                    "if": { "$eq": ["$totalPayments", 0] },
                    "then": "NaN",
                    "else": "$totalPayments"
                }
            }
        }
    },

    { "$sort": { "employeeNumber": 1 }}
])

rq2_df = pandas.DataFrame(list(rq2))
rq2_df


# Pour chaque employé on a son nombre de clients, commandes et le montant total. On voit que Diane, Mary et Jeff n'ont pas réalisé de commande et
# donc ont un montant total de null (NaN)

,employeeNumber,firstname,lastname,numberOfCustomers,numberOfOrders,totalOrderAmount
0,1002,Diane,Murphy,0,0,NaN
1,1056,Mary,Patterson,0,0,NaN
2,1076,Jeff,Firrelli,0,0,NaN
3,1088,William,Patterson,0,0,NaN
4,1102,Gerard,Bondur,0,0,NaN
5,1143,Anthony,Bow,0,0,NaN
6,1165,Leslie,Jennings,6,34,12674066.13
7,1166,Leslie,Thompson,6,14,943442.48
8,1188,Julie,Firrelli,6,14,1035043.99
9,1216,Steve,Patterson,6,18,1545990.08
10,1286,Foon Yue,Tseng,7,17,1635226.6
11,1323,George,Vanauf,8,22,1870933.55
12,1337,Loui,Bondur,6,20,2093279.51
13,1370,Gerard,Hernandez,7,43,21850743.39
14,1401,Pamela,Castillo,10,31,2580550.55
15,1501,Larry,Bott,8,22,2188718.8
16,1504,Barry,Jones,9,25,2357369.87
17,1611,Andy,Fixter,5,19,2352253.84
18,1612,Peter,Marsh,5,19,2119701.72
19,1619,Tom,King,0,0,NaN
20,1621,Mami,Nishi,5,16,1815463.17
21,1625,Yoshimi,Kato,0,0,NaN
22,1702,Martin,Gerard,6,12,1014439.14

In [48]:
rq3 = db.Offices.aggregate([
    { 
        "$lookup": {
            "from": "Customers",
            "localField": "Employees.employeeNumber",
            "foreignField": "salesRepEmployeeNumber",
            "as": "Clients"
        }
    },
    {
        "$addFields": { 
            "nombreClients": { "$size": "$Clients" },
            "totalCommandes": { 
                "$sum": { 
                    "$map": { 
                        "input": "$Clients", 
                        "as": "client", 
                        "in": { "$size": { "$ifNull": [ "$$client.Orders", [] ] } }
                    } 
                }
            },
            "clientsFromDifferentCountries": {
                "$size": {
                    "$filter": {
                        "input": "$Clients",
                        "as": "client",
                        "cond": { "$ne": ["$$client.country", "$country"] }
                    }
                }
            }
        }
    },

    { "$unwind": {
        "path": "$Clients",
        "preserveNullAndEmptyArrays": True
    }},
    
    { "$unwind": {
        "path": "$Clients.Orders",
        "preserveNullAndEmptyArrays": True
    }},
    
    { "$unwind": {
        "path": "$Clients.Payments",
        "preserveNullAndEmptyArrays": True
    }},
    
    { 
        "$group": { 
            "_id": "$officeCode",
            "nombreClients": { "$first": "$nombreClients" },  
            "totalCommandes": { "$first": "$totalCommandes" }, 
            "totalPayments": { "$sum": "$Clients.Payments.amount" }, 
            "nombrePaysDistincts": {"$first": "$clientsFromDifferentCountries"},
            "pays": {"$first": "$country"},
            "ville": {"$first": "$city"}
        }
    },

    {
        "$project": {
            "_id": 0,
            "officeCode": "$_id",
            "city": "$ville",
            "country": "$pays",
            "numberOfCustomers": "$nombreClients",
            "numberOfOrders": "$totalCommandes",
            "totalOrderAmount": {
                "$cond": {
                    "if": { "$eq": ["$totalPayments", 0] },
                    "then": "nan",
                    "else": "$totalPayments"
                }
            },
            "customersFromDifferentCountry": "$nombrePaysDistincts"
        }
    },

    { "$sort": { "officeCode": 1 }}
])

rq3_df = pandas.DataFrame(list(rq3))
rq3_df


# On donne le nombre de commandes, montant total et nombre de clients venant d'un pays différent pour chaque bureau. On voit que San Francisco
# a 12 clients, 48 commandes un montant total de plus de 13 millions et 0 clients étrangés.

,officeCode,city,country,numberOfCustomers,numberOfOrders,totalOrderAmount,customersFromDifferentCountry
0,1.0,San Francisco,USA,12,48,13617508.61,0
1,2.0,Boston,USA,12,32,2581034.07,0
2,3.0,NYC,USA,15,39,3506160.15,3
3,4.0,Paris,France,29,106,27539012.59,17
4,5.0,Tokyo,Japan,5,16,1815463.17,3
5,6.0,Sydney,Australia,10,38,4471955.56,5
6,7.0,London,UK,17,47,4546088.67,12

In [49]:
rq4 = db.Products.aggregate([
    {
        "$lookup": {
            "from": "Customers",
            "localField": "productCode",
            "foreignField": "Orders.OrderDetails.productCode",
            "as": "customerOrders"
        }
    },
    {
        "$unwind": {
            "path": "$customerOrders",
            "preserveNullAndEmptyArrays": True
        }
    },
    {
        "$unwind": {
            "path": "$customerOrders.Orders",
            "preserveNullAndEmptyArrays": True
        }
    },
    {
        "$unwind": {
            "path": "$customerOrders.Orders.OrderDetails",
            "preserveNullAndEmptyArrays": True
        }
    },
    {
        "$match": {
            "$or": [
                { "$expr": { "$eq": ["$customerOrders.Orders.OrderDetails.productCode", "$productCode"] } },
                { "customerOrders": { "$eq": None } }
            ]
        }
    },
    {
        "$group": {
            "_id": "$productCode",
            "nomProduit": { "$first": "$productName" },
            "totalOccurrences": { "$sum": { "$cond": [{ "$ifNull": ["$customerOrders", False] }, 1, 0] } },
            "totalQuantity": { "$sum": { "$ifNull": ["$customerOrders.Orders.OrderDetails.quantityOrdered", 0] } },
            "uniqueClients": { "$addToSet": "$customerOrders.customerNumber" }
        }
    },
    {
        "$addFields": {
            "nombreClientDistincs": { "$size": "$uniqueClients" }
        }
    },
    {
        "$sort": { "_id": 1 }
    },
    {
        "$project": {
            "_id": 1,
            "nomProduit": 1,
            "totalOccurrences": 1,
            "totalQuantity": 1,
            "nombreClientDistincs": 1
        }
    }
])

rq4_df = pandas.DataFrame(list(rq4))
rq4_df

# Pour chaque produit on donne le nombre de fois où il a été commandé, la quantité total commandée et le nombre distinct de client qui a commandé
# le produit. Par exemple le modèle 1969 Harley Davidson Ultimate Chopper se retrouve dans 28 commandes, il a été commandé 1026 par 26 clients différents

,_id,nomProduit,totalOccurrences,totalQuantity,nombreClientDistincs
0,S10_1678,1969 Harley Davidson Ultimate Chopper,28,1026,26
1,S10_1949,1952 Alpine Renault 1300,28,961,27
2,S10_2016,1996 Moto Guzzi 1100i,28,999,26
3,S10_4698,2003 Harley-Davidson Eagle Drag Bike,28,985,25
4,S10_4757,1972 Alfa Romeo GTA,28,1000,27
...,...,...,...,...,...
105,S700_3505,The Titanic,27,952,22
106,S700_3962,The Queen Mary,27,883,24
107,S700_4002,American Airlines: MD-11S,28,1073,26
108,S72_1253,Boeing X-32A JSF,28,960,27
109,S72_3212,Pont Yacht,27,958,24

In [193]:
rq5 = db.Customers.aggregate([
    {
        "$lookup": {
            "from": "Customers",
            "localField": "_id",
            "foreignField": "_id",
            "as": "Commandes"
        }
    },
    { 
        "$unwind": { 
            "path": "$Orders", 
            "preserveNullAndEmptyArrays": True 
        }
    },
    {
        "$addFields": {
            "montantCommande": {
                "$cond": {
                    "if": { "$gt": ["$Orders", None] },
                    "then": {
                        "$sum": {
                            "$map": {
                                "input": { "$ifNull": ["$Orders.OrderDetails", []] },
                                "as": "item",
                                "in": { "$multiply": ["$$item.quantityOrdered", "$$item.priceEach"] }
                            }
                        }
                    },
                    "else": 0
                }
            },
            "montantPaye": { "$sum": "$Payments.amount" },
            "nombreCommande": { "$cond": { "if": { "$gt": ["$Orders", None] }, "then": 1, "else": 0 } }
        }
    },
    {
        "$group": {
            "_id": "$country",
            "Nombre de Commande": { "$sum": "$nombreCommande" },  
            "Montant Total Commande": { "$sum": "$montantCommande"},
            "Montant Total Payé": {"$sum":"$montantPaye"}
        }
    },
    { "$sort": { "_id": 1 } }
])

pandas.DataFrame(list(rq5))

,_id,Nombre de Commande,Montant Total Commande,Montant Total Payé
0,Australia,19,630623.10,2352253.84
1,Austria,7,202062.53,487494.02
2,Belgium,7,108412.62,333442.11
3,Canada,7,224078.56,421283.00
4,Denmark,7,245637.15,796334.75
5,Finland,9,329581.91,988745.73
6,France,37,1110916.56,3324693.52
7,Germany,7,220472.09,576293.44
8,Hong Kong,2,48784.36,97568.72
9,Ireland,2,57756.43,115512.86
10,Israel,0,0.00,0.00
11,Italy,10,403626.22,963279.67
12,Japan,6,188167.81,570898.86
13,Netherlands,0,0.00,0.00
14,New Zealand,15,535584.00,1668057.12
15,Norway,9,307463.70,959766.06
16,Philippines,3,94015.73,282047.19
17,Poland,0,0.00,0.00
18,Portugal,0,0.00,0.00
19,Russia,0,0.00,0.00
20,Singapore,9,288488.41,1316593.00
21,South Africa,0,0.00,0.00
22,Spain,36,1215686.92,21398341.40
23,Sweden,7,210014.21,705797.51
24,Switzerland,2,117713.56,235427.12
25,UK,13,478880.46,1199973.07
26,USA,112,3627982.85,19283419.83

In [186]:
rq6 = db.Customers.aggregate([
    {
        "$unwind": "$Orders" 
    },
    {
        "$unwind": "$Orders.OrderDetails" 
    },
    { 
        "$lookup": {
            "from": "Products",  
            "localField": "Orders.OrderDetails.productCode",  
            "foreignField": "productCode", 
            "as": "productDetails" 
        }
    },
    {
        "$unwind": {
            "path": "$productDetails", 
            "preserveNullAndEmptyArrays": True 
        }
    },
    {
        "$group": {
            "_id": {
                "orderNumber": "$Orders.orderNumber",  
                "country": "$country",  
                "productLine": "$productDetails.productLine"  
            },
            "customerName": { "$first": "$customerName" }  
        }
    },
    {
        "$group": {
            "_id": {
                "productLine": "$_id.productLine",  
                "country": "$_id.country"  
            },
            "totalOrders": { "$sum": 1 }  
        }
    },
    {
        "$project": {
            "_id": 0,
            "productLine": "$_id.productLine", 
            "country": "$_id.country",  
            "totalOrders": 1  
        }
    },
    {
        "$sort": {
            "productLine": 1,
            "country": 1
        }
    }
])


result_df = pandas.DataFrame(list(rq6))
result_df = result_df[['productLine', 'country', 'totalOrders']]
print(result_df)

# Pour chaque pays et chaque catégorie on a le total des commandes. Par exemple, on a l'Australie qui a commandé 12 produits de la catégorie Classic Cars.

      productLine    country  totalOrders
0    Classic Cars  Australia           12
1    Classic Cars    Austria            5
2    Classic Cars    Belgium            2
3    Classic Cars     Canada            6
4    Classic Cars    Denmark            5
..            ...        ...          ...
121  Vintage Cars  Singapore            4
122  Vintage Cars      Spain           22
123  Vintage Cars     Sweden            4
124  Vintage Cars         UK           10
125  Vintage Cars        USA           67

[126 rows x 3 columns]

In [174]:
# Pipeline d'agrégation
rq7 = db.Customers.aggregate([
    # Déconstruire les commandes et leurs détails
    {
        "$unwind": "$Orders"
    },
    {
        "$unwind": "$Orders.OrderDetails"
    },
    # Joindre la collection Products pour récupérer les informations sur le productLine
    {
        "$lookup": {
            "from": "Products",
            "localField": "Orders.OrderDetails.productCode",
            "foreignField": "productCode",
            "as": "ProductInfo"
        }
    },
    {
        "$unwind": "$ProductInfo"
    },
    # Grouper par pays et productLine
    {
        "$group": {
            "_id": {
                "country": "$country",
                "productLine": "$ProductInfo.productLine"
            },
            "totalPayments": {"$sum": {"$sum": "$Payments.amount"}}
        }
    },
    # Ajouter les colonnes 'country' et 'productLine' avec un $project
    {
        "$project": {
            "_id": 0,
            "country": "$_id.country",
            "productLine": "$_id.productLine",
            "totalPayments": 1
        }
    },
    # Trier par totalPayments décroissant
    {
        "$sort": {
            "productLine": 1,
            "country": 1
        }
    },
])

# Exécuter l'agrégation
results_df = pd.DataFrame(list(rq7))
results_df = results[['productLine', 'country', 'totalPayments']]
results_df

      productLine    country  totalPayments
0    Classic Cars  Australia     7504795.97
1    Classic Cars    Austria     1884419.42
2    Classic Cars    Belgium      166880.87
3    Classic Cars     Canada      774924.01
4    Classic Cars    Denmark     3678313.22
..            ...        ...            ...
121  Vintage Cars  Singapore     1941227.28
122  Vintage Cars      Spain    39878490.66
123  Vintage Cars     Sweden     1377094.16
124  Vintage Cars         UK     4673162.78
125  Vintage Cars        USA    47090713.86

[126 rows x 3 columns]

In [189]:
rq8 = db.Products.aggregate([
    {
        "$lookup": {
            "from": "Customers",
            "localField": "productCode",
            "foreignField": "Orders.OrderDetails.productCode",
            "as": "detailCommande"
        }
    },
    {
        "$unwind": "$detailCommande" 
    },
    {
        "$unwind": "$detailCommande.Orders"  
    },
    {
        "$unwind": "$detailCommande.Orders.OrderDetails" 
    },
    {
        "$match": {
            "$expr": { "$eq": ["$productCode", "$detailCommande.Orders.OrderDetails.productCode"] }
        }
    },
    {
        "$project": {
            "productCode": "$productCode",
            "productName": "$productName",
            "marge": {
                "$subtract": ["$detailCommande.Orders.OrderDetails.priceEach", "$buyPrice"]
            }  
        }
    },
    {
        "$group": {
            "_id": {
                "productCode": "$productCode",
                "productName": "$productName"
            },
            "averageMargin": {"$avg": "$marge"} 
        }
    },
    {
        "$project": {
            "_id": 0,
            "productCode": "$_id.productCode",
            "productName": "$_id.productName",
            "averageMargin": 1
        }
    },
    {
        "$sort": {
            "averageMargin": -1 
        }
    },
    {
        "$limit": 10
    }
])


result_df = pandas.DataFrame(list(rq8))
result_df = result_df[['productCode', 'productName', 'averageMargin']] 
print(result_df)


# Pour chaque produit on a la marge moyenne du produit. Par exemple, pour le modèle 1952 Alpine Renault 1300 la marge moyenne du produit est de 99.006429.

  productCode                           productName  averageMargin
0    S10_1949              1952 Alpine Renault 1300      99.006429
1    S10_4698  2003 Harley-Davidson Eagle Drag Bike      95.235000
2    S18_3232           1992 Ferrari 360 Spider red      83.334906
3    S12_2823                      2002 Suzuki XREO      83.201429
4    S18_2795                1928 Mercedes-Benz SSK      82.696786
5    S12_1108                     2001 Ferrari Enzo      81.043704
6    S12_3891                      1969 Ford Falcon      77.335926
7    S18_3685        1948 Porsche Type 356 Roadster      72.636800
8    S18_2870          1999 Indy 500 Monte Carlo SS      71.794400
9    S18_1749              1917 Grand Touring Sedan      70.432800

In [147]:
rq9 = db.Customers.aggregate([
    {
        '$unwind': '$Orders'
    },
    {
        '$unwind': '$Orders.OrderDetails'
    },
    {
        '$lookup': {
            'from': 'Products',
            'localField': 'Orders.OrderDetails.productCode',
            'foreignField': 'productCode',
            'as': 'product_info'
        }
    },
    {
        '$unwind': '$product_info'
    },
    {
        '$project': {
            '_id': 0,
            'customerNumber': 1,
            'productCode': '$Orders.OrderDetails.productCode',
            'productName': '$product_info.productName',
            'priceEach': '$Orders.OrderDetails.priceEach',
            'buyPrice': '$product_info.buyPrice'
        }
    },
    {
        '$match': {
            '$expr': { 
                '$lt': ['$priceEach', '$buyPrice']
            }
        }
    }
])

results_df = pandas.DataFrame(list(rq9))
results_df

# On veut les produits vendu à perte (prix unitaire < prix d'achat). On voit que le modèle 1957 Chevy Pickup a un prix unitaire de 35.71 et le prix
# d'achat est de 55.70.

,customerNumber,productCode,productName,priceEach,buyPrice
0,124,S12_4473,1957 Chevy Pickup,35.71,55.70
1,124,S24_4048,1992 Porsche Cayenne Turbo Silver,50.32,69.78
2,124,S50_1392,Diamond T620 Semi-Skirted Tanker,56.55,68.29
3,124,S18_2238,1998 Chrysler Plymouth Prowler,88.00,101.51
4,124,S18_1984,1995 Honda Civic,43.05,93.89
...,...,...,...,...,...
74,398,S24_1785,1928 British Royal Navy Airplane,50.65,66.74
75,323,S12_1099,1968 Ford Mustang,93.28,95.34
76,323,S12_3380,1968 Dodge Charger,73.15,75.16
77,323,S18_2238,1998 Chrysler Plymouth Prowler,69.81,101.51
78,382,S12_1099,1968 Ford Mustang,79.65,95.34

In [55]:
rq10 = db.Customers.aggregate([
    {
        "$addFields": {
            "montantPaye": { "$sum": "$Payments.amount" }  
        }
    },
    { 
        "$unwind": "$Orders"
    },
    {
        "$unwind": "$Orders.OrderDetails"
    },
    {
        "$addFields": {
            "montantCommande": { "$multiply": [
                "$Orders.OrderDetails.quantityOrdered",
                "$Orders.OrderDetails.priceEach"
            ] }
        }
    },
    {
        "$group": {
            "_id": "$customerNumber",
            "codeClient": { "$first": "$customerNumber" },
            "nomClient": { "$first": "$customerName" },
            "Montant Total Payé": { "$first": "$montantPaye" },
            "Montant Total Commande": { "$sum": "$montantCommande" }
        }
    },
    {
        "$match": {
            "$expr": { "$gt": [ "$Montant Total Payé", "$Montant Total Commande" ] }  
        }
    }
])
result_df = pandas.DataFrame(list(rq10))
result_df

# On a la liste des clients avec un montant des paiements supérieur a celui des achats, comme Toys4GrownUps.com

,_id,codeClient,nomClient,Montant Total Payé,Montant Total Commande
0,205,205,Toys4GrownUps.com,104561.96,104561.96
1,181,181,Vitachrome Inc.,88041.26,88041.26
2,129,129,Mini Wheels Co.,74476.18,74476.18
3,299,299,"Norway Gifts By Mail, Co.",79224.23,79224.23
4,249,249,Amica Models & Co.,94117.26,94117.26